MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mk22fn128vdc10.s
/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the Default_Handler.
* As they are weak aliases, any function with the same name will override
* this definition.
*
*******************************************************************************/

    .weak      NMI_Handler
    .thumb_set NMI_Handler,Default_Handler

    .weak      HardFault_Handler
    .thumb_set HardFault_Handler,Default_Handler

    .weak      MemManage_Handler
    .thumb_set MemManage_Handler,Default_Handler

    .weak      BusFault_Handler
    .thumb_set BusFault_Handler,Default_Handler

    .weak      UsageFault_Handler
    .thumb_set UsageFault_Handler,Default_Handler

    .weak      SVC_Handler
    .thumb_set SVC_Handler,Default_Handler

    .weak      DebugMon_Handler
    .thumb_set DebugMon_Handler,Default_Handler

    .weak      PendSV_Handler
    .thumb_set PendSV_Handler,Default_Handler

    .weak      SysTick_Handler
    .thumb_set SysTick_Handler,Default_Handler

    .weak      DMA0_IRQHandler
    .thumb_set DMA0_IRQHandler,Default_Handler

    .weak      DMA1_IRQHandler
    .thumb_set DMA1_IRQHandler,Default_Handler

    .weak      DMA2_IRQHandler
    .thumb_set DMA2_IRQHandler,Default_Handler

    .weak      DMA3_IRQHandler
    .thumb_set DMA3_IRQHandler,Default_Handler

    .weak      Reserved20_IRQHandler
    .thumb_set Reserved20_IRQHandler,Default_Handler

    .weak      Reserved21_IRQHandler
    .thumb_set Reserved21_IRQHandler,Default_Handler

    .weak      Reserved22_IRQHandler
    .thumb_set Reserved22_IRQHandler,Default_Handler

    .weak      Reserved23_IRQHandler
    .thumb_set Reserved23_IRQHandler,Default_Handler

    .weak      Reserved24_IRQHandler
    .thumb_set Reserved24_IRQHandler,Default_Handler

    .weak      Reserved25_IRQHandler
    .thumb_set Reserved25_IRQHandler,Default_Handler

    .weak      Reserved26_IRQHandler
    .thumb_set Reserved26_IRQHandler,Default_Handler

    .weak      Reserved27_IRQHandler
    .thumb_set Reserved27_IRQHandler,Default_Handler

    .weak      Reserved28_IRQHandler
    .thumb_set Reserved28_IRQHandler,Default_Handler

    .weak      Reserved29_IRQHandler
    .thumb_set Reserved29_IRQHandler,Default_Handler

    .weak      Reserved30_IRQHandler
    .thumb_set Reserved30_IRQHandler,Default_Handler

    .weak      Reserved31_IRQHandler
    .thumb_set Reserved31_IRQHandler,Default_Handler

    .weak      DMA_Error_IRQHandler
    .thumb_set DMA_Error_IRQHandler,Default_Handler

    .weak      MCM_IRQHandler
    .thumb_set MCM_IRQHandler,Default_Handler

    .weak      FTFA_IRQHandler
    .thumb_set FTFA_IRQHandler,Default_Handler

    .weak      Read_Collision_IRQHandler
    .thumb_set Read_Collision_IRQHandler,Default_Handler

    .weak      LVD_LVW_IRQHandler
    .thumb_set LVD_LVW_IRQHandler,Default_Handler

    .weak      LLWU_IRQHandler
    .thumb_set LLWU_IRQHandler,Default_Handler

    .weak      WDOG_EWM_IRQHandler
    .thumb_set WDOG_EWM_IRQHandler,Default_Handler

    .weak      Reserved39_IRQHandler
    .thumb_set Reserved39_IRQHandler,Default_Handler

    .weak      I2C0_IRQHandler
    .thumb_set I2C0_IRQHandler,Default_Handler

    .weak      I2C1_IRQHandler
    .thumb_set I2C1_IRQHandler,Default_Handler

    .weak      SPI0_IRQHandler
    .thumb_set SPI0_IRQHandler,Default_Handler

    .weak      SPI1_IRQHandler
    .thumb_set SPI1_IRQHandler,Default_Handler

    .weak      I2S0_Tx_IRQHandler
    .thumb_set I2S0_Tx_IRQHandler,Default_Handler

    .weak      I2S0_Rx_IRQHandler
    .thumb_set I2S0_Rx_IRQHandler,Default_Handler

    .weak      LPUART0_IRQHandler
    .thumb_set LPUART0_IRQHandler,Default_Handler

    .weak      UART0_IRQHandler
    .thumb_set UART0_IRQHandler,Default_Handler

    .weak      UART0_ERR_IRQHandler
    .thumb_set UART0_ERR_IRQHandler,Default_Handler

    .weak      UART1_IRQHandler
    .thumb_set UART1_IRQHandler,Default_Handler

    .weak      UART1_ERR_IRQHandler
    .thumb_set UART1_ERR_IRQHandler,Default_Handler

    .weak      UART2_IRQHandler
    .thumb_set UART2_IRQHandler,Default_Handler

    .weak      UART2_ERR_IRQHandler
    .thumb_set UART2_ERR_IRQHandler,Default_Handler

    .weak      Reserved53_IRQHandler
    .thumb_set Reserved53_IRQHandler,Default_Handler

    .weak      Reserved54_IRQHandler
    .thumb_set Reserved54_IRQHandler,Default_Handler

    .weak      ADC0_IRQHandler
    .thumb_set ADC0_IRQHandler,Default_Handler

    .weak      CMP0_IRQHandler
    .thumb_set CMP0_IRQHandler,Default_Handler

    .weak      CMP1_IRQHandler
    .thumb_set CMP1_IRQHandler,Default_Handler

    .weak      FTM0_IRQHandler
    .thumb_set FTM0_IRQHandler,Default_Handler

    .weak      FTM1_IRQHandler
    .thumb_set FTM1_IRQHandler,Default_Handler

    .weak      FTM2_IRQHandler
    .thumb_set FTM2_IRQHandler,Default_Handler

    .weak      Reserved61_IRQHandler
    .thumb_set Reserved61_IRQHandler,Default_Handler

    .weak      RTC_IRQHandler
    .thumb_set RTC_IRQHandler,Default_Handler

    .weak      RTC_Seconds_IRQHandler
    .thumb_set RTC_Seconds_IRQHandler,Default_Handler

    .weak      PIT0_IRQHandler
    .thumb_set PIT0_IRQHandler,Default_Handler

    .weak      PIT1_IRQHandler
    .thumb_set PIT1_IRQHandler,Default_Handler

    .weak      PIT2_IRQHandler
    .thumb_set PIT2_IRQHandler,Default_Handler

    .weak      PIT3_IRQHandler
    .thumb_set PIT3_IRQHandler,Default_Handler

    .weak      PDB0_IRQHandler
    .thumb_set PDB0_IRQHandler,Default_Handler

    .weak      USB0_IRQHandler
    .thumb_set USB0_IRQHandler,Default_Handler

    .weak      Reserved70_IRQHandler
    .thumb_set Reserved70_IRQHandler,Default_Handler

    .weak      Reserved71_IRQHandler
    .thumb_set Reserved71_IRQHandler,Default_Handler

    .weak      DAC0_IRQHandler
    .thumb_set DAC0_IRQHandler,Default_Handler

    .weak      MCG_IRQHandler
    .thumb_set MCG_IRQHandler,Default_Handler

    .weak      LPTMR0_IRQHandler
    .thumb_set LPTMR0_IRQHandler,Default_Handler

    .weak      PORTA_IRQHandler
    .thumb_set PORTA_IRQHandler,Default_Handler

    .weak      PORTB_IRQHandler
    .thumb_set PORTB_IRQHandler,Default_Handler

    .weak      PORTC_IRQHandler
    .thumb_set PORTC_IRQHandler,Default_Handler

    .weak      PORTD_IRQHandler
    .thumb_set PORTD_IRQHandler,Default_Handler

    .weak      PORTE_IRQHandler
    .thumb_set PORTE_IRQHandler,Default_Handler

    .weak      SWI_IRQHandler
    .thumb_set SWI_IRQHandler,Default_Handler

    .weak      Reserved81_IRQHandler
    .thumb_set Reserved81_IRQHandler,Default_Handler

    .weak      Reserved82_IRQHandler
    .thumb_set Reserved82_IRQHandler,Default_Handler

